# Normal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriOrQuadFacet..::..Normal Property
TriOrQuadFacet Class See Also
---
A unit normal vector for this facet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ Normal { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Normal As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Normal {
	XYZ^ get ();
}
```

# See Also
TriOrQuadFacet Class
Autodesk.Revit.DB Namespace